Revit 2027 API
NumberingFormatSettings Properties
The NumberingFormatSettings type exposes the following members.
Properties
Name | Description
AsCharacters |  True if the number is using characters, false for digits.
FirstNumberFormattingOption |  The formatting options for the start of a sequence.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MinimumNumberOfDigits |  Defines the minimum digit count for the numerical display.
NumberOfParameters |  A property defining the number of parameters used in this formatting settings object.
UppercaseCharacters |  if asCharacters is enabled, the characters will be presented as uppercase.
Top
See Also
Reference
NumberingFormatSettings Class
Autodesk.Revit.DB Namespace